sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
// Private helper functions.
// These may or may not be present in all applications.
static void InitAppConfig(void);
static void InitializeBoard(void);
static void ProcessIO(void);
void FanControl();

#if defined(WF_CS_TRIS)
    static void WF_Connect(void);
#endif
/*
void __attribute__((__interrupt__,__no_auto_psv__)) _T7Interrupt( void )
{
    static BYTE Up = 0;    
    //T7CONbits.TON = 0;
    if(Up == 1){
        LATBbits.LATB4 = 1;
        Up = 0;
        PR7 = 2000;
    } else {
        LATBbits.LATB4 = 0;
        Up = 1;
        PR7 = 1000;
    }
    //T7CONbits.TON = 1;
    //LATBbits.LATB4 ^= 1;
    IFS3bits.T7IF = 0;
}
*/
//
// PIC18 Interrupt Service Routines
// 
// NOTE: Several PICs, including the PIC18F4620 revision A3 have a RETFIE FAST/MOVFF bug
// The interruptlow keyword is used to work around the bug when using C18
#if defined(__18CXX)
#if defined(HI_TECH_C)
void interrupt low_priority LowISR(void)
#else
#pragma interruptlow LowISR
void LowISR(void)
#endif
{
    TickUpdate();
}
    
#if defined(HI_TECH_C)
void interrupt HighISR(void)
#else
#pragma interruptlow HighISR
void HighISR(void)
#endif
{
    Nop();    
}

#if !defined(HI_TECH_C)
#pragma code lowVector=0x18
void LowVector(void){_asm goto LowISR _endasm}
#pragma code highVector=0x8
void HighVector(void){_asm goto HighISR _endasm}
#pragma code // Return to default code section
#endif

// C30 and C32 Exception Handlers
// If your code gets here, you either tried to read or write
// a NULL pointer, or your application overflowed the stack
// by having too many local variables or parameters declared.
#elif defined(__C30__)
void _ISR __attribute__((__no_auto_psv__)) _AddressError(void)
{
    while(1){
        Nop();
        Nop();
    }
}
void _ISR __attribute__((__no_auto_psv__)) _StackError(void)
{
    while(1){
        Nop();
        Nop();
    }
}
void _ISR __attribute__((__no_auto_psv__)) _MathError(void)
{
    while(1){
        Nop();
        Nop();
    }
}  
void _ISR __attribute__((__no_auto_psv__)) _OscillatorFail(void)
{
    while(1){
        Nop();
        Nop();
    }
}   
void _ISR __attribute__((__no_auto_psv__)) _DMACError(void)
{
    while(1){
        Nop();
        Nop();
    }
} /*
void __attribute__((__interrupt__,__no_auto_psv__)) _T6Interrupt( void )
{    
    //static WORD T;
    //static WORD T1;
    //T  = TMR8;
    //T1 = TMR9HLD;
    //TMR9HLD = 0x0000;
    //TMR8 = 0x0000;
    //TMR6 = 0x7FFF;
    //CPUSPEED.word.LW = T;
    //CPUSPEED.word.HW = T1;
    IFS2bits.T6IF = 0; // Clear T6 interrupt flag
    TimerMonitor();
}   
*/ 
#elif defined(__C32__)
    void _general_exception_handler(unsigned cause, unsigned status)
    {
        Nop();
        Nop();
    }
#endif

/*
unsigned int BufferA[128] __attribute__((space(dma)));
unsigned int BufferAS[128] __attribute__((space(dma)));
unsigned int BufferB[128] __attribute__((space(dma)));
unsigned int BufferBS[128] __attribute__((space(dma)));
*/
// DMA Interrupt Handler
void fillingBufferR(WORD * Buf, WORD Count)
{
    static int T = 0;
    int i = 0;    
    for(i = 0; i < Count; i++){
        Buf[i] = (int)(T+1)*200;
        T++;
    }
}
void fillingBufferRS(WORD * Buf, WORD Count)
{
    static int T = 0;
    int i = 0;    
    for(i = 0; i < Count; i++){
        Buf[i] = (int)(T+1)*200+25;
        T++;
    }
}
void fillingBufferR1(WORD * Buf, WORD Count)
{
    static int T = 0;
    int i = 0;    
    for(i = 0; i < Count; i++){
        Buf[i] = (int)(T+1)*200;
        T++;
    }
}
void fillingBufferRS1(WORD * Buf, WORD Count)
{
    static int T = 0;
    int i = 0;    
    for(i = 0; i < Count; i++){
        Buf[i] = (int)(T+1)*200+25;
        T++;
    }
}

//
// Main application entry point.
//
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{  
        
    static DWORD t = 0;
    static DWORD d = 0;
    static DWORD dwLastIP = 0;
    static int TimeAdjusted = 0;
    // указатель на функцию
    //int (*p)(void); // объявление
    //p = OCSetup;    // присвоение
    //p();			  // вызов

    //volatile DWORD UTCT;
    LATFbits.LATF4 = 0;
    TRISFbits.TRISF4 = 0;   
    
        
    // Initialize application specific hardware
    // Для работы A13  его нужно отключить от ADC
    {
        TRISAbits.TRISA12 = 1;
        AD1CON1 = 0;
        AD2CON1 = 0;
        AD1PCFGH = 0xFFFF;
        AD1PCFGL = 0xFFFF;
        AD2PCFGL = 0xFFFF;
    }
        
    //BYTE res;
    //char bfr[64];
    //BYTE length=0;
    //AppConfig.MyIPAddr.Val = 0x12345678;
    //while(1){
    //    res = RunClient(bfr, sizeof(bfr), &length);        
    //    res = ProcessClients(0, bfr, &length);            
    //}
    
    if(0){
        {
            // Initialize Output Compare Module in Contionous pulse mode
            OCInit(ID_OC1, IDLE_DISABLE, OC_TMR2, OC_DISABLED);
            OCSetValue(ID_OC1, 100, 125);
            OCSetInt(ID_OC1, 6, TRUE);
            OCSetCallback(ID_OC1, NULL);
            OCSetMode(ID_OC1, CONT_PULSE);
            
            // Initialize Timer2
            TimerInit(T2, CLOCK_SOURCE_INTERNAL, GATED_DISABLE, PRE_1_1, IDLE_DISABLE, BIT_16, SYNC_DISABLE);
            TimerSetValue(T2, 0, 0xFFFF);
            OCSetCallback(T2, NULL);
            TimerSetInt(T2, 5, FALSE);

            // Initialize Timer3
            TimerInit(T3, CLOCK_SOURCE_INTERNAL, GATED_DISABLE, PRE_1_1, IDLE_DISABLE, BIT_16, SYNC_DISABLE);
            TimerSetValue(T3, 0, 0xFFFF);
            OCSetCallback(T3, NULL);
            TimerSetInt(T3, 5, FALSE);
           
            // Setup and Enable DMA Channel
            DMAInit(DMA0, SIZE_WORD, RAM_TO_DEVICE, FULL_BLOCK, NORMAL_OPS, REG_INDIRECT_W_POST_INC, CONTINUE_PP);
            DMASelectDevice(DMA0, IRQ_OC1, (int)&OC1R);
            DMASetBufferSize(DMA0, 64);
            DMASetCallback(DMA0, (ROM void*)fillingBufferR, (ROM void*)fillingBufferR);
            DMASetInt(DMA0, 5, TRUE);
            DMAPrepBuffer(DMA0);
            DMASetState(DMA0, TRUE, FALSE);
            
            DMAInit(DMA1, SIZE_WORD, RAM_TO_DEVICE, FULL_BLOCK, NORMAL_OPS, REG_INDIRECT_W_POST_INC, CONTINUE_PP);
            DMASelectDevice(DMA1, IRQ_OC1, (int)&OC1RS);
            DMASetBufferSize(DMA1, 64);
            DMASetCallback(DMA1, (ROM void*)fillingBufferRS, (ROM void*)fillingBufferRS);
            DMASetInt(DMA1, 5, TRUE);
            DMAPrepBuffer(DMA1);
            DMASetState(DMA1, TRUE, FALSE);            
            
            // Initialize Output Compare Module in Contionous pulse mode
            OCInit(ID_OC2, IDLE_DISABLE, OC_TMR3, OC_DISABLED);
            OCSetValue(ID_OC2, 100, 125);
            OCSetInt(ID_OC2, 6, TRUE);
            OCSetCallback(ID_OC2, NULL);            
            OCSetMode(ID_OC2, CONT_PULSE);
            
            // Setup and Enable DMA Channel
            DMAInit(DMA2, SIZE_WORD, RAM_TO_DEVICE, FULL_BLOCK, NORMAL_OPS, REG_INDIRECT_W_POST_INC, CONTINUE_PP);
            DMASelectDevice(DMA2, IRQ_OC2, (int)&OC2R);
            DMASetBufferSize(DMA2, 64);
            DMASetCallback(DMA2, (ROM void*)fillingBufferR1, (ROM void*)fillingBufferR1);
            DMASetInt(DMA2, 5, TRUE);
            DMAPrepBuffer(DMA2);
            DMASetState(DMA2, TRUE, FALSE);
            
