sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
            DMAInit(DMA3, SIZE_WORD, RAM_TO_DEVICE, FULL_BLOCK, NORMAL_OPS, REG_INDIRECT_W_POST_INC, CONTINUE_PP);
            DMASelectDevice(DMA3, IRQ_OC2, (int)&OC2RS);
            DMASetBufferSize(DMA3, 64);
            DMASetCallback(DMA3, (ROM void*)fillingBufferRS1, (ROM void*)fillingBufferRS1);
            DMASetInt(DMA3, 5, TRUE);
            DMAPrepBuffer(DMA3);
            DMASetState(DMA3, TRUE, FALSE);      
            // Enable Timer
            //TimerSetState(T2, TRUE);
            //TimerSetState(T3, TRUE);
            T2CONbits.TON = 1;
            T3CONbits.TON = 1;
            /*
            DMAForceTransfer(DMA0);
            DMAForceTransfer(DMA1);
            DMAForceTransfer(DMA2);
            DMAForceTransfer(DMA3);
            */
        }
        while(1){
           Nop();
           Nop();
        }
    }
    
    if(0){
        OCSetup();
        //вызов предпросчета двигателей
        {
            T6CON = 0x0030; //0.000000025*256 = 0.0000064 = 6.4us
            TMR6 = 0x0000;  //
            PR6 = 10;//;    //0.0000064 * 10 = 0.000064 = 64us
            IFS2bits.T6IF = 0;
            IEC2bits.T6IE = 1;
            IPC11bits.T6IP = 5;    
            T6CONbits.TON = 1;
        } 
//        PushCmdToQueue(&rr1, ST_ACCELERATE, 20.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);
//        PushCmdToQueue(&rr1, ST_RUN, 20.0,  45.0 * Grad_to_Rad, 1);
//        PushCmdToQueue(&rr1, ST_DECELERATE, 0.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1); 
//        //Control(&rr1);
//        PushCmdToQueue(&rr2, ST_ACCELERATE, 18.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);
//        PushCmdToQueue(&rr2, ST_RUN, 18.0,  45.0 * Grad_to_Rad, 1);
//        PushCmdToQueue(&rr2, ST_DECELERATE, 0.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);         
//        //Control(&rr2);
//        
//        
//        PushCmdToQueue(&rr3, ST_ACCELERATE, 10.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);
//        PushCmdToQueue(&rr3, ST_RUN, 10.0,  45.0 * Grad_to_Rad, 1);
//        PushCmdToQueue(&rr3, ST_DECELERATE, 0.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1); 
        GoToCmd(&rr1, -0.00417807934636275010445197530291 * Grad_to_Rad, 90 * Grad_to_Rad, 0);
        //Control(&rr3);
        
        while(1){
            //TimerMonitor();
            Nop();
            ////Control(&rr1);
            //Control(&rr2);
            //Control(&rr3);
        }
     }   
    InitializeBoard();
    // calculate CPU speed  
    if(0){
        T6CON = 0x0002;
        T8CON = 0x0008;
        T9CON = 0x0000;
        PR8=0xFFFF;
        PR9=0xFFFF;
        TMR6 = 0x7FFF;
        TMR8 = 0x0000;
        TMR9 = 0x0000;    
        CPUSPEED.Val = 0;
        IFS2bits.T6IF = 0;
        IEC2bits.T6IE = 1;
        IPC11bits.T6IP = 7;
        T6CONbits.TON = 1;
        T8CONbits.TON = 1;    
    }
    
    
#if defined(USE_LCD)
    // Initialize and display the stack version on the LCD
    LCDInit();
    DelayMs(100);
    strcpypgm2ram((char*)LCDText, "TCPStack " TCPIP_STACK_VERSION "  "
        "                ");
    LCDUpdate();
#endif

    // Initialize stack-related hardware components that may be 
    // required by the UART configuration routines
    TickInit();
#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
    MPFSInit();
#endif

    // Initialize Stack and application related NV variables into AppConfig.
    InitAppConfig();

    // Initiates board setup process if button is depressed 
    // on startup
    #ifdef bad
    if(BUTTON0_IO == 0u)
    {
    #if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
    // Invalidate the EEPROM contents if BUTTON0 is held down for more than 4 seconds
    DWORD StartTime = TickGet();
    LED_PUT(0x00);
            
    while(BUTTON0_IO == 0u)
    {
        if(TickGet() - StartTime > 4*TICK_SECOND)
        {
            #if defined(EEPROM_CS_TRIS)
            XEEBeginWrite(0x0000);
            XEEWrite(0xFF);
            XEEWrite(0xFF);
            XEEEndWrite();
            #elif defined(SPIFLASH_CS_TRIS)
            SPIFlashBeginWrite(0x0000);
            SPIFlashWrite(0xFF);
            SPIFlashWrite(0xFF);
            #endif
            
            #if defined(STACK_USE_UART)
            putrsUART("\r\n\r\nBUTTON0 held for more than 4 seconds.  Default settings restored.\r\n\r\n");
            #endif

            LED_PUT(0x0F);
            while((LONG)(TickGet() - StartTime) <= (LONG)(9*TICK_SECOND/2));
            LED_PUT(0x00);
            while(BUTTON0_IO == 0u);
            Reset();
            break;
        }
    }
    #endif

    #if defined(STACK_USE_UART)
        DoUARTConfig();
    #endif
    }
    #endif //bad
    // Initialize core stack layers (MAC, ARP, TCP, UDP) and
    // application modules (HTTP, SNMP, etc.)
    StackInit();

    #if defined(WF_CS_TRIS)
    WF_Connect();
    #endif

    // Initialize any application-specific modules or functions/
    // For this demo application, this only includes the
    // UART 2 TCP Bridge
    #if defined(STACK_USE_UART2TCP_BRIDGE)
    UART2TCPBridgeInit();
    #endif

    #if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
    ZeroconfLLInitialize();
    #endif

    #if defined(STACK_USE_ZEROCONF_MDNS_SD)
    mDNSInitialize(MY_DEFAULT_HOST_NAME);
    mDNSServiceRegister(
        (const char *) "DemoWebServer",    // base name of the service
        "_http._tcp.local",                // type of the service
        80,                                // TCP or UDP port, at which this service is available
        ((const BYTE *)"path=/index.htm"),    // TXT info
        1,                                    // auto rename the service when if needed
        NULL,                                // no callback function
        NULL                                // no application context
        );

    mDNSMulticastFilterRegister();            
    #endif

    if(0){
	    LoadRRConfig();
	    OCSetup();
	    //вызов предпросчета двигателей
	    {
	        T6CON = 0x0030; //0.000000025*256 = 0.0000064 = 6.4us
	        TMR6 = 0x0000;  //
	        PR6 = 10;//;    //0.0000064 * 10 = 0.000064 = 64us
	        IFS2bits.T6IF = 0;
	        IEC2bits.T6IE = 1;
	        IPC11bits.T6IP = 5;    
	        T6CONbits.TON = 1;
	    } 
    }
    //Вентиляторы        
    {
        TRISBbits.TRISB4 = 0;
        T7CON = 0x0030; //0.000000025*256 = 0.0000064
        TMR7 = 0x0000;
        PR7 = 16384;//512;
        IFS3bits.T7IF = 0;
        IEC3bits.T7IE = 1;
        IPC12bits.T7IP = 4;    
        T7CONbits.TON = 1;
    } 
    /*
    PushCmdToQueue(&rr1, ST_ACCELERATE, 10.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);
    PushCmdToQueue(&rr1, ST_RUN, 10.0,  90.0 * Grad_to_Rad, 1);
    PushCmdToQueue(&rr1, ST_DECELERATE, 0.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1); 
    //Control(&rr1);
    
    PushCmdToQueue(&rr2, ST_ACCELERATE, 10.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);
    PushCmdToQueue(&rr2, ST_RUN, 10.0,  45.0 * Grad_to_Rad, 1);
    PushCmdToQueue(&rr2, ST_DECELERATE, 0.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);         
    */
    //Control(&rr2);
    //0.004166667
    //GoToCmd(&rr1, 0.0 * Grad_to_Rad, 90.0 * Grad_to_Rad, 0);
    //GoToCmd(&rr2, 0.0 * Grad_to_Rad, 10.0 * Grad_to_Rad, 0);
    
