sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
    //PushCmdToQueue(&rr3, ST_ACCELERATE, 10.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1);
    //PushCmdToQueue(&rr3, ST_RUN, 10.0,  45.0 * Grad_to_Rad, 1);
    //PushCmdToQueue(&rr3, ST_DECELERATE, 0.0 * Grad_to_Rad, 180.0 * Grad_to_Rad, 1); 
    //Control(&rr3); 
    /*
    while(1){
        Nop();
    }*/
    // Now that all items are initialized, begin the co-operative
    // multitasking loop.  This infinite loop will continuously 
    // execute all stack-related tasks, as well as your own
    // application's functions.  Custom functions should be added
    // at the end of this loop.
    // Note that this is a "co-operative mult-tasking" mechanism
    // where every task performs its tasks (whether all in one shot
    // or part of it) and returns so that other tasks can do their
    // job.
    // If a task needs very long time to do its job, it must be broken
    // down into smaller pieces so that other tasks can have CPU time.
    while(1)
    {
        //Control(&rr1);
        //Control(&rr2);
        //Control(&rr3);
        // Blink LED0 (right most one) every second.
        
        //if(TickGet() - d >= TICK_SECOND/16000ul)
        //{
        //    d = TickGet();
        //       LATDbits.LATD0 ^= 1; // выход STEP
            
        //}
        //TimerMonitor();
        //FanControl();        
        if(PORTAbits.RA13 != t){
            t = PORTAbits.RA13;
                LED0_IO = t;
                //if(!TimeAdjusted){
                //    TimeAdjusted = AdjustLocalRTCTime(); 
                //    LED2_IO = TimeAdjusted;           
                //}
                RRConfigRAM.RRSave[0].XPosition = rr1.XPosition;
                RRConfigRAM.RRSave[1].XPosition = rr2.XPosition;                
                   RRConfigRAM.RRSave[2].XPosition = rr3.XPosition;
                SaveRRConfig();
        }
        // This task performs normal stack task including checking
        // for incoming packet, type of packet and calling
        // appropriate stack entity to process it.
        StackTask();

        // This tasks invokes each of the core stack application tasks
        StackApplications();

        #if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
        ZeroconfLLProcess();
        #endif

        #if defined(STACK_USE_ZEROCONF_MDNS_SD)
        mDNSProcess();
    // Use this function to exercise service update function
    // HTTPUpdateRecord();
        #endif

    // Process application specific tasks here.
    // For this demo app, this will include the Generic TCP 
    // client and servers, and the SNMP, Ping, and SNMP Trap
    // demos.  Following that, we will process any IO from
    // the inputs on the board itself.
    // Any custom modules or processing you need to do should
    // go here.
    #if defined(STACK_USE_GENERIC_TCP_CLIENT_EXAMPLE)
    GenericTCPClient();
    #endif
    
    #if defined(STACK_USE_GENERIC_TCP_SERVER_EXAMPLE)
    GenericTCPServer();
    #endif
    
    #if defined(STACK_USE_SMTP_CLIENT)
    SMTPDemo();
    #endif
    
    #if defined(STACK_USE_ICMP_CLIENT)
    PingDemo();
    #endif
    
    #if defined(STACK_USE_SNMP_SERVER) && !defined(SNMP_TRAP_DISABLED)
    //User should use one of the following SNMP demo
    // This routine demonstrates V1 or V2 trap formats with one variable binding.
    SNMPTrapDemo();
    
    #if defined(SNMP_STACK_USE_V2_TRAP) || defined(SNMP_V1_V2_TRAP_WITH_SNMPV3)
    //This routine provides V2 format notifications with multiple (3) variable bindings
    //User should modify this routine to send v2 trap format notifications with the required varbinds.
    //SNMPV2TrapDemo();
    #endif 
    if(gSendTrapFlag)
        SNMPSendTrap();
    #endif
    
    #if defined(STACK_USE_BERKELEY_API)
    //BerkeleyTCPClientDemo();
        BerkeleyTCPServerDemo();
    //BerkeleyUDPClientDemo();
    #endif

    ProcessIO();

        // If the local IP address has changed (ex: due to DHCP lease change)
        // write the new IP address to the LCD display, UART, and Announce 
        // service
    if(dwLastIP != AppConfig.MyIPAddr.Val)
    {
        dwLastIP = AppConfig.MyIPAddr.Val;
            
        #if defined(STACK_USE_UART)
            putrsUART((ROM char*)"\r\nNew IP Address: ");
        #endif

        DisplayIPValue(AppConfig.MyIPAddr);

        #if defined(STACK_USE_UART)
            putrsUART((ROM char*)"\r\n");
        #endif


        #if defined(STACK_USE_ANNOUNCE)
            AnnounceIP();
        #endif

            #if defined(STACK_USE_ZEROCONF_MDNS_SD)
            mDNSFillHostRecord();
        #endif
    }
    }
}
int AdjustLocalRTCTime()
{
    DWORD RTCSeconds;
    DWORD SNTPSeconds;
#if defined(STACK_USE_SNTP_CLIENT)&&defined(SPIRTCSRAM_CS_TRIS)
    //имеет смысл только при работающем модуле SNTP
    if(SNTPIsTimeValid())
    {
        //RTCSeconds = RTCGetUTCSeconds();  
        SNTPSeconds = SNTPGetUTCSeconds();
        //if((RTCSeconds>SNTPSeconds+2)||(RTCSeconds<SNTPSeconds-2)){
            SetTimeFromUTC(SNTPSeconds); 
        //}
        return 1;
    }    
#endif
    return 0;
}

DWORD UTCGetTime(void)
{
#if defined(STACK_USE_SNTP_CLIENT)&&defined(SPIRTCSRAM_CS_TRIS)
    //if(RTCIsTimeValid()){
    //    return RTCGetUTCSeconds();
    //} else
    if(SNTPIsTimeValid()) {
        //получаем время из SNTP модуля
        return SNTPGetUTCSeconds();
    } else {
        return RTCGetUTCSeconds();
    }
#endif
}


#if defined(WF_CS_TRIS)
/*****************************************************************************
 * FUNCTION: WF_Connect
 *
 * RETURNS:  None
 *
 * PARAMS:   None
 *
 *  NOTES:   Connects to an 802.11 network.  Customize this function as needed 
 *           for your application.
 *****************************************************************************/
static void WF_Connect(void)
{
    UINT8 ConnectionProfileID;
    UINT8 channelList[] = MY_DEFAULT_CHANNEL_LIST;
    #if defined(WF_USE_POWER_SAVE_FUNCTIONS)
    BOOL  PsPollEnabled;
    #endif
    
    /* create a Connection Profile */
    WF_CPCreate(&ConnectionProfileID);

    #if defined(STACK_USE_UART)
    putrsUART("Set SSID (");
    putsUART(AppConfig.MySSID);
    putrsUART(")\r\n");
    #endif
    WF_CPSetSsid(ConnectionProfileID, 
                 AppConfig.MySSID, 
                 AppConfig.SsidLength);

    #if defined(STACK_USE_UART)
    putrsUART("Set Network Type\r\n");
    #endif
    WF_CPSetNetworkType(ConnectionProfileID, MY_DEFAULT_NETWORK_TYPE);
    
    #if defined(STACK_USE_UART)
    putrsUART("Set Scan Type\r\n");
    #endif
    WF_CASetScanType(MY_DEFAULT_SCAN_TYPE);
    
    #if defined(STACK_USE_UART)
    putrsUART("Set Channel List\r\n");
    #endif    
    WF_CASetChannelList(channelList, sizeof(channelList));
    
    #if defined(STACK_USE_UART)
    putrsUART("Set list retry count\r\n");
    #endif
    WF_CASetListRetryCount(MY_DEFAULT_LIST_RETRY_COUNT);

    #if defined(STACK_USE_UART)        
    putrsUART("Set Event Notify\r\n");    
    #endif
    WF_CASetEventNotificationAction(MY_DEFAULT_EVENT_NOTIFICATION_LIST);
    
