sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
                // Set flag and restart loop to load ROM defaults and save them
                vNeedToSaveDefaults = 1;
                continue;
            }
            
            // If we get down here, it means the EEPROM/Flash has valid contents 
            // and either matches the ROM defaults or previously matched and 
            // was run-time reconfigured by the user.  In this case, we shall 
            // use the contents loaded from EEPROM/Flash.
            break;
        }
        #endif
        break;
    }
}

#if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)|| defined(SPIRTCSRAM_CS_TRIS)
void SaveAppConfig(const APP_CONFIG *ptrAppConfig)
 {
    NVM_VALIDATION_STRUCT NVMValidationStruct;

    // Ensure adequate space has been reserved in non-volatile storage to 
    // store the entire AppConfig structure.  If you get stuck in this while(1) 
    // trap, it means you have a design time misconfiguration in TCPIPConfig.h.
    // You must increase MPFS_RESERVE_BLOCK to allocate more space.
    #if (defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)) && !defined(SPIRTCSRAM_CS_TRIS)
        if(sizeof(NVMValidationStruct) + sizeof(AppConfig) > MPFS_RESERVE_BLOCK)
            while(1);
    #endif

    // Get proper values for the validation structure indicating that we can use 
    // these EEPROM/Flash contents on future boot ups
    NVMValidationStruct.wOriginalChecksum = wOriginalAppConfigChecksum;
    NVMValidationStruct.wCurrentChecksum = CalcIPChecksum((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    NVMValidationStruct.wConfigurationLength = sizeof(APP_CONFIG);

    // Write the validation struct and current AppConfig contents to EEPROM/Flash
    #if defined(EEPROM_CS_TRIS)
        XEEBeginWrite(0x0000);
        XEEWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
        XEEWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    //#elif defined(SPIRTCSRAM_CS_TRIS)
    //    SPISRAMBeginWrite(0x0000);
    //    SPISRAMWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
    //    SPISRAMWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));        
    #else
        SPIFlashBeginWrite(0x0000);
        SPIFlashWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
        SPIFlashWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
        
    #endif
}
#endif

void SaveRRConfig()
 {
    NVM_VALIDATION_STRUCT NVMValidationStruct;

    // Ensure adequate space has been reserved in non-volatile storage to 
    // store the entire AppConfig structure.  If you get stuck in this while(1) 
    // trap, it means you have a design time misconfiguration in TCPIPConfig.h.
    // You must increase MPFS_RESERVE_BLOCK to allocate more space.
    if(sizeof(NVMValidationStruct) + sizeof(RAMSaveConfig) > 256)
            while(1);
        
    // Get proper values for the validation structure indicating that we can use 
    // these EEPROM/Flash contents on future boot ups
    NVMValidationStruct.wOriginalChecksum = 0;
    NVMValidationStruct.wCurrentChecksum = CalcIPChecksum((BYTE*)&RRConfigRAM, sizeof(RAMSaveConfig));
    NVMValidationStruct.wConfigurationLength = sizeof(RAMSaveConfig);

    // Write the validation struct and current AppConfig contents to CMOS RAM    
    #if defined(SPIRTCSRAM_CS_TRIS)
        SPISRAMBeginWrite(0x0000);
        SPISRAMWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
        SPISRAMWriteArray((BYTE*)&RRConfigRAM, sizeof(RAMSaveConfig));        
    #endif
}

void LoadRRConfig()
{
    NVM_VALIDATION_STRUCT NVMValidationStruct;
    #if defined(SPIRTCSRAM_CS_TRIS)
    {
        SPISRAMReadArray(0x0000, (BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
        SPISRAMReadArray(sizeof(NVMValidationStruct), (BYTE*)&RRConfigRAM, sizeof(RAMSaveConfig));
    }
    #endif
    if((NVMValidationStruct.wConfigurationLength != sizeof(RAMSaveConfig)) ||       
       (NVMValidationStruct.wCurrentChecksum != CalcIPChecksum((BYTE*)&RRConfigRAM, sizeof(RAMSaveConfig))))
    {
        BYTE i;        
        for(i = 0; i<3;i++){
            RRConfigRAM.RRSave[i].Timestamp = 0;
            RRConfigRAM.RRSave[i].XPosition = 0;
            RRConfigRAM.RRSave[i].uStepPerStep = 16;
        }
    }    
}

